[
  {
    "cityName": "Kharkiv",
    "cityCode": "ua",
    "description": "Kharkiv, the second-largest city in Ukraine, is a vibrant and historically rich metropolis. Here are some interesting facts about Kharkiv:",
    "educationalHub": "Kharkiv is often referred to as the 'Student City' because it houses some of Ukraine's most prestigious universities, including Kharkiv National University and Kharkiv Polytechnic Institute.",
    "technologyIndustry": "Kharkiv has a strong industrial base, with a focus on aerospace, machinery, and electronics. The city has been a center for scientific and technological innovation.",
    "metroSystem": "Kharkiv boasts one of the oldest metro systems in Ukraine. The Kharkiv Metro is not only a practical means of transportation but also a showcase of Soviet-era architecture."
  },
  {
    "cityName": "London",
    "cityCode": "uk",
    "description": "London, the capital of the United Kingdom, is a global city known for its rich history and cultural diversity. Here are some interesting facts about London:",
    "educationalHub": "London is home to several world-renowned universities, including Imperial College London and University College London.",
    "technologyIndustry": "The city has a thriving technology sector, with many startups and tech companies contributing to its innovation landscape.",
    "metroSystem": "London has an extensive public transportation system, including the iconic London Underground, providing efficient travel throughout the city."
  },
  {
    "cityName": "New York",
    "cityCode": "us",
    "description": "New York City, often simply called New York, is the most populous city in the United States. Here are some interesting facts about New York:",
    "educationalHub": "New York City hosts prestigious educational institutions such as Columbia University and New York University.",
    "technologyIndustry": "The city is a major hub for technology and innovation, with Silicon Alley in Manhattan being a focal point for tech companies.",
    "metroSystem": "New York City's subway system is one of the largest and busiest in the world, providing essential transportation for millions of residents and visitors."
  }
]